Revit 2027 API
DirectShape.GetExternallyTaggedGeometry Method
 Gets the externally tagged geometry by its external ID that is stored in this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternallyTaggedGeometryObject GetExternallyTaggedGeometry(
	ExternalGeometryId externalId
)
Public Function GetExternallyTaggedGeometry (
	externalId As ExternalGeometryId
) As ExternallyTaggedGeometryObject
public:
ExternallyTaggedGeometryObject^ GetExternallyTaggedGeometry(
	ExternalGeometryId^ externalId
)
member GetExternallyTaggedGeometry :
        externalId : ExternalGeometryId -> ExternallyTaggedGeometryObject
Parameters
externalId ExternalGeometryId
 The external ID of the externally tagged geometry that should be obtained.
Return Value
ExternallyTaggedGeometryObject
 The externally tagged geometry. Or null if there is no such externally tagged geometry in the DirectShape.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace